{"data":{"0":[{"comment":"\"Actually I need twenty bucks, I'm losing my job...\"     😂😂😂","label":"News"},{"comment":"\"And he was presented with the medal of freedom by a good friend of his, a guy you might not know he knows because he doesnt like to talk about him... Barack Obama.\"  xD","label":"News"},{"comment":"\"Boy, you boy! What administration is it??\"  \"Today, it's a Biden administration, sir!\" Then I flip him a farthing to go buy me a goose and he asks me to Venmo him instead. \nIt's like your favorite restaurant is serving a new dish, because the daily special for the last four years was \"Filet of broken glass with a shallot and bleach remoulade\"","label":"News"},{"comment":"\"Four years, maybe eight years.\"\n\nOH THANK GOD IT WASN'T EIGHT YEARS.","label":"News"},{"comment":"\"I dont´t think it´s the job of a dad to be your best friend!\" \"Well i do.\" that caught me off guard hahaha","label":" Arts & Entertainment"},{"comment":"\"I got to believe the next mower will do his best.\" Oh boy. That didn't age well.","label":" Home & Garden Yard & Patio Lawn Mowers"},{"comment":"\"I ran on a ticket with Gilgamesh\" - I snorted","label":"Technology"},{"comment":"\"I ran on a unity ticket with Gilgamesh!\"\n😆🤣🤣🤣🤣","label":"News"},{"comment":"\"I ran on a unity ticket with Gilgamesh!\"   --that was gold, gave me a huge laugh","label":" Arts & Entertainment"},{"comment":"\"Joe and Kamala, or as no one calls them... Jomala\"\n\nWHEEZE","label":"News"},{"comment":"\"Life is like a grandfather clock\"😆","label":"Technology"},{"comment":"\"No one has been more effective than Biden at making deals across the aisle, in the past 5 decades\"\n- and that my friend is the REAL, art of the deal.","label":"News"},{"comment":"\"Or as no one calls them... Joemala\"\n😂😂😂😂","label":"News"},{"comment":"2:23 - That cuneiform baked-clay bumper sticker tho","label":"News"},{"comment":"2:31 \"Crowned with many winters.\" Ah, Stephen, you cute little Tolkien nerd you.","label":" Arts & Entertainment"},{"comment":"7:44 “I'm so gosh-damned ... darned disappointed!” \n\nYes, a lot of us were a tad miffed back in 2016. Thank the bleeping bleep that's finally over.","label":" Arts & Entertainment"},{"comment":"A President that’s a normal human being is so refreshing..  thanks Steven for having us share that normal exchange.. ahhh I can breathe 🧘‍♀️","label":"News"},{"comment":"A competent president that has receded many of 45's executive orders that only benefit  Trumps friends and political backers, not the American people!","label":" Law & Government Government"},{"comment":"A president who doesnt have time for cute tweets or twisted mind games with his staff. Republicans must be dumbfounded.","label":"News"},{"comment":"A president with a sense of humor that doesn't take himself too seriously.  How novel.","label":"News"},{"comment":"According to Trump, Biden was asleep on the campaign. Not bad going for a man who Republicans claimed has dementia and sleepy. Go Joe you’re doing great!","label":" News Politics"},{"comment":"Ahh President Joe Biden.. I will never get tired of saying that.","label":"News"},{"comment":"Ahh, remember back in 2016 when you could sit shoulder to shoulder to someone?","label":"News"},{"comment":"And we all know that if Trump was asked to do this, he'd accuse them all of trying to make him look stupid by giving him big words he can't read and storm out in the middle of it.","label":" News Politics"},{"comment":"Any job worth doing is worth doing well. Clearly, Donnie never learned that lesson. I'm sure Joe will do a much better job with the 'lawn'...","label":" Arts & Entertainment"},{"comment":"Anyone enjoying the fact that not once have we had to hear Joe Biden screaming at reporters, no insane conspiracy theories from press conferences, and NO TWEETING","label":"News"},{"comment":"As a Canadian I'm so glad for you guys. And Stephen looks super happy.","label":"Fice"},{"comment":"As a mythology nerd, the Gilgamesh bit tickled me to no end 😂. Someone needs to ask Biden if he knew Enkidu now...and if that man was really a beast or just a bit hairy. Also I can’t spell 🤦🏽‍♀️","label":"News"},{"comment":"Awww.\nYou guys are so cute together.\nStephen, you need to ask Joe if he'll adopt you to be on his team.\nYou can head up the Truthiness Team.","label":" Arts & Entertainment Humor"},{"comment":"Biden might not have dementia, but he definitely has a personality and a sense of humor.","label":"News"},{"comment":"Biden's smile after that ants in the pants joke, you know he was thinking \"That was good, I'm gonna tell that one later!\"🤣","label":" Arts & Entertainment"},{"comment":"Can anyone imagine Trump ever laughing at himself like this?","label":"News"},{"comment":"Can’t believe nobody did a Cotton Eye Joe parody with The President and VP yet. “If hadn’t been for Kamala and Joe, we’d be fucked a long time ago” or something like that","label":" Arts & Entertainment Humor"},{"comment":"Check your malarkey at the door, Jack! It's time for Stephen Colbert to celebrate three friends of the show who have brought a refreshing change in leadership to Washington, President Joe Biden, Dr. Jill Biden, and Vice President Kamala Harris. #Colbert #JoeBiden ","label":" Arts & Entertainment TV & Video TV Shows & Programs"},{"comment":"Did anyone else catch the fart at 10:05? Was that you, Stephen? Or was that you, Mr. President? 😂","label":" Arts & Entertainment Humor Funny Pictures & Videos"},{"comment":"Did anyone else notice the giant bowl of butterscotch candy on the table in front of them.  This show has more attention to detail and continuity than Game of Thrones","label":" Food & Drink"},{"comment":"Every time you say “Jack” with aviators on, I lose my shit. Such a good impression. Love you Colbert. Hope you’re using that glub jug.","label":" Arts & Entertainment"},{"comment":"Funny the people Trump gave the Medal of Freedom to are the types that would probably have preferred to get Pardons instead.","label":" Arts & Entertainment Humor"},{"comment":"Glad to have adults in the White House.","label":"News"},{"comment":"Gotta say, it's surreal to actually hear an audience during the skit. Like...I'm just so use to how things are at this point","label":" Arts & Entertainment"},{"comment":"Hail JOE “CAPTAIN AMERICA” BIDEN... 😂","label":"News"},{"comment":"Has it only been 9 days? They've done more than you know who in 4 yrs.","label":"News"},{"comment":"Have to laugh at a cuneiform joke. Thank you, Stephen.","label":"Fice"},{"comment":"He finally said “a historic” instead of “an historic”","label":"Technology"},{"comment":"His face when Biden said Damn, lol! I had to rewind it!","label":"News"},{"comment":"I always found Joe’s stutter endearing, my grandpa had one too.","label":"News"},{"comment":"I believe 2021 will be better to every one who read this 💪💪","label":"News"},{"comment":"I feel like we’re in a horror movie and we think the villain is going to pop up again.","label":" Arts & Entertainment Movies"},{"comment":"I forgot what an audience sounded like. I didn't know how much I missed you people","label":"Beauty"},{"comment":"I get so much joy from not hearing T** after the word “President”.\n\nIt’s calming.","label":"News"},{"comment":"I just loved that “Family Meeting” segment.... thanks for being here!","label":"Beauty"},{"comment":"I laughed so hard with Stephen and Mr. President's skit.   I needed that. The world around us has become so crazy with some peoples crazy beliefs. I see Mr President as a normal human being with sense of humor. We are going to be alright now. We have someone in office that knows what he is doing.  Thanks to both of you.","label":" Arts & Entertainment Humor"},{"comment":"I like President Joe Biden... he's got a good sense of humor and is a kind human being","label":" News Politics"},{"comment":"I never paid attention to Biden’s hair, and don’t plan to now. It’s just awful cool that he ain’t trippin’ either.","label":"News"},{"comment":"I remember this family meeting that Stephen and Joe had when it aired.","label":"News"},{"comment":"I smiled when Joe came in,  \nI'm not even American, I'm just happy for you guys","label":" Books & Literature"},{"comment":"I totally forgot that the \"Tell him about the birds and the bees\" joke came from that skit with Stephen lmao","label":" Arts & Entertainment"},{"comment":"I was confused at first then I realized that's the sound of an actual audience  😂","label":"Beauty"},{"comment":"I was so depressed after the 16 election I MISSED the Dad, Pop, Kid family meeting bit. Joe and Steven killed it. <3  Thanks for bringing it back.","label":"News"},{"comment":"I'VE HAD ENOUGH OF THIS GOSH DAMN MALARKEY! 😂","label":"Beauty"},{"comment":"I'm happy you didn't stop at \"first black vice-president.\"","label":"News"},{"comment":"I'm so ready for that picnic on the freshly mowed lawn. I will also take 20 bucks.","label":" Arts & Entertainment"},{"comment":"I'm so use to people having to social distance as soon as Joe sat down my 1st thought was \"whoa! Thats way to close\" 🙄","label":"News"},{"comment":"If Stephen and Joe can only communicate Mass times with each other, that makes them both Mass Relays, and that effect should be called, the Mass Effect.","label":"Technology"},{"comment":"If we didn't already know that Joe is a good bloke just look at his dogs. You can tell a lot about a person by how they interact with their dogs. Having dogs is already a big step up from T__ who only had Eric and Don Jr and I don't think they were house trained because they left a huge pile of shit behind that Joe now has to clean up.","label":" Hobbies & Leisure"},{"comment":"If you Elect a qualified president then he brings all the qualified People and professionalism in his Administration.","label":"News"},{"comment":"Imagine just how much the US has saved on helicopter fuel, since it's no longer a feature of every presidential press conference.","label":"News"},{"comment":"Impersonator? I can’t tell. Just his face looks so smooth.","label":"Beauty"},{"comment":"In the COVID age, this had a real uncanny valley feel to it!","label":"News"},{"comment":"Is it just me or has Stephen started to glow since Biden took office?","label":"News"},{"comment":"Isn’t it such a relief that one can turn on the news without getting hit by yet another roller-coaster breaking news of Presidential tweets and stupidity?","label":"News"},{"comment":"It feels good to have a president that makes a joke instead of being a joke.","label":"News"},{"comment":"It's a Pattern. Republican president destroy the country and Democrat President Fix the country.","label":"News"},{"comment":"It's pretty cool to see two people sitting near each other with no mask","label":"Technology"},{"comment":"It's so ... Not refreshing, but relaxing to have decent people back in the white house.","label":"News"},{"comment":"It's so nice hearing the Biden impression instead of the Other One","label":"News"},{"comment":"It's so weird seeing people sitting shoulder to shoulder and without masks. This year has ruined my perception of normalcy.","label":" People & Society"},{"comment":"It's so weird seeing two non-related individuals sitting next to each other having a conversation instead of 6 feet apart muffling behind their masks. Hopefully we can kick this virus goodbye soon.","label":"News"},{"comment":"It's strange to see people sitting so close together on a couch.","label":"News"},{"comment":"It's weird seeing a federal press briefing with information.","label":"News"},{"comment":"Its nice to see a president on TV talking to the  people, no bullying, no swearing, no belittling of other people , no yelling , and not showing his signature after signing an executive order .","label":"News"},{"comment":"I’m  a Persian and I loved Stephen saying “Gilgamesh”!","label":"Fice"},{"comment":"I’ve never seen a circle come this full before.","label":"News"},{"comment":"I’ve slept the BEST these last NINE days than I have in the last FOUR years☺️😊☺️","label":"News"},{"comment":"Joe and Stephen: the gay parents I didn’t realize I needed","label":"News"},{"comment":"Joe is much more pleasant at breaking promises that’s for sure.","label":"News"},{"comment":"Joe: \"Hey champ, how ya doin'?\"\n\nChamp at home: \"HOLY SH*T DAD'S ON TV?!?!?\"","label":"News"},{"comment":"Joe: We're not mad we're just disappointed.\nStephen: I'm actually mad, I'm really mad.\nXD","label":"News"},{"comment":"Joe’s smile just lights a room","label":"Beauty"},{"comment":"Keep in mind when listening to Joe, is he overcame a terrible stutter.  Kudos!","label":"News"},{"comment":"Look how we took for granted sitting right next to each other","label":"Beauty"},{"comment":"Love the fact that president Biden can joke about himself and loves dogs, and respects his wife and all mankind!😙👌❤️🙌🏼 He has done more in this first days than trumps entire presidency!","label":" News Politics"},{"comment":"My God that was wholesome. I'm from Canada, but I always looked up to Joe because he was a kid that had a stutter and he never let anything slow him down, now he's the president. I also had a stutter as a kid, I still kinda do. So it's really great to see","label":" People & Society Religion & Belief"},{"comment":"Never trust a man that doesn't like dogs, and always trust a dog when it doesn't like a man.","label":" Arts & Entertainment"},{"comment":"OH MY GOD the audience clapping was so overwhelming... We haven´t heard that in a looooong time.","label":" Arts & Entertainment"},{"comment":"Ohhhh that orange man has to be pissed about the fact he wasn’t ever invited to a late night show!😂😂😂😂","label":" News"},{"comment":"Omg look at how much younger Steven looks. Those 4 years really aged all of us","label":"Beauty"},{"comment":"One of my favorite yet least talked about bits Stephen does is checking his watch. That always gives me a laugh.","label":"News"},{"comment":"People laughing with actual joy, without that slight sadness that crept in every time 'yeah its funny, wish it wasn't', that lasted four mirthful years...","label":" Arts & Entertainment Humor"},{"comment":"President Joe really does have one of the nicest smiles.","label":"News"},{"comment":"Remember when they had to awkwardly wait for live applause to end??!!?? God life was so good and we didn’t even realize","label":" Arts & Entertainment"},{"comment":"Rep. Marjorie Taylor Greene keeping her seat in Congress, is like hiring a flat-earther to head up NASA.\n🙄 Bye Qaren.","label":"News"},{"comment":"Seeing people sit next to each other on a couch is WILD","label":"News"},{"comment":"Seeing these two youngsters sit shoulder to shoulder brings back so many memories of, well, sitting next to someone!","label":"News"},{"comment":"So wonderful! Joe, tell him about the birds and the bees,... \"well the birds and the bees are disappearing at an alarming rate. \" Haha. How can you not love Joe.","label":"News"},{"comment":"Stephen casually throwing in a Tolkien reference is the best Stephen.\n\"Venerable he seemed as a king crowned with many winters, and yet hale as a tried warrior in the fulness of his strength.\"","label":" Books & Literature"},{"comment":"Stephen's scandalized look when Joe cusses gets me every time. 😭😂","label":"News"},{"comment":"Still terrifying that Trump tried to turn those \"Four years\" into \"Forever\".","label":"News"},{"comment":"THat family meeting bit was genuinely pretty hilarious. But I also really loved that \"Unity ticket with Gilgamesh\" joke.","label":" Arts & Entertainment Humor"},{"comment":"Thank you so much for sharing these flashback moments!! 💋🤍💙❤ Epic!","label":"Fice"},{"comment":"That clip just reminded it was okay to sit right next to someone and whisper in their face","label":"News"},{"comment":"That “regretting listing his bed on AirBnB” joke got me good.","label":"News"},{"comment":"The cuneiform bumper sticker sent me back to the Stone Age","label":"Technology"},{"comment":"The entire United States right now is like me when I broke up with my abusive boyfriend. \"Look at the new guy! He doesn't shout, swear or blow up at random! Look at this guy! He's incredible!\" I think we all need group therapy after what we've been through.","label":"News"},{"comment":"The first part of this hard me rollin on the floor.  \"It's a Biiiden administration, Sir!\"","label":" Arts & Entertainment"},{"comment":"The guy has been wanting to be President his whole life, I’m sure he’s had a plan.  The Golfer President didn’t really want to be president...","label":" Sports Individual Sports Golf"},{"comment":"The guy responsible for mowing the lawn for the last 4 years was watering it with gasoline and Brawndo.","label":" Home & Garden Yard & Patio"},{"comment":"The lawn was a strip mine when Joe got it.","label":"News"},{"comment":"The occasional laugh makes these really good\n Also secret Chatolic telepaty im dead.","label":"Beauty"},{"comment":"This felt like: ‘How I Met Your President’","label":"News"},{"comment":"This is what a COMPETENT President looks like, folks! See the difference...yet?","label":"News"},{"comment":"We love “Pop-Pop Joe!” Great stuff, Daddy Steven.","label":"News"},{"comment":"We need family meetings more often. Make this a thing, Stephen! It was great! 😅","label":"Fice"},{"comment":"What a treat, an extra special Friday edition of the Late Show!!!!!! Unseen clips of my beloved President & Madame Vice President- what a welcome & pleasant surprise!!!!!!!!","label":" Arts & Entertainment"},{"comment":"When Biden tells a joke, people actually laugh instead of fact checking to see if it was supposed to be a joke. Isn't it nice, real person with sense of humor? Best dressed VP ever.","label":" News Politics"},{"comment":"When Joe Biden sat next to Stephen, my knee jerk reaction was \"they are too close\", just before rational thinking set in allowing me to think \"yeah, this was OK before covid-19\". I miss something as simple as being close to friendly people other than my nuclear family without feeling I am doing something wrong and dangerous.","label":" News Politics"},{"comment":"Who knew he was so gosh darn charming and funny? When Irish eyes are smiling.","label":"Beauty"},{"comment":"Who’s triggered by them sitting that close on the couch, ugg!  I mis the before times","label":"News"},{"comment":"Whyd I almost cry when he said everyone should feel safe to have a picnic in the lawn.","label":"News"},{"comment":"Wow that flashback reminds me that I don't miss the random screaming at all.","label":"Beauty"},{"comment":"Wow, that \"Crowned with many winters\" reference was amazing","label":"Beauty"},{"comment":"Wow. What a difference a human being in the White House makes.","label":"News"},{"comment":"back when you get sit that close to someone without going into a panic attack because they don't have a mask on lmao","label":"News"},{"comment":"it’s very nice to see Stephan happy.","label":"Fice"},{"comment":"ok the birds and the bees part got me","label":"News"},{"comment":"should've been\n“Joe time like the president.”","label":"News"},{"comment":"“Go ask your mother.”\nNever realized how presidential my dad was.","label":"News"},{"comment":"“I ran on a unity ticket with Gilgamesh” 😂😂","label":"News"},{"comment":"“It’s like your restaurant getting a Michelin star and then finding out they also gave one to Arby’s” 🤣","label":" Food & Drink Restaurants"},{"comment":"“Listen Jack, there’s always one more Jack than you think.”","label":"News"},{"comment":"“Never touched a lawn mower” figurative and very, very literal.","label":"News"}]},"labels":{"0":["News"," Arts & Entertainment"," Home & Garden Yard & Patio Lawn Mowers","Technology"," Law & Government Government"," News Politics","Fice"," Arts & Entertainment Humor"," Arts & Entertainment TV & Video TV Shows & Programs"," Arts & Entertainment Humor Funny Pictures & Videos"," Food & Drink"," Arts & Entertainment Movies","Beauty"," Books & Literature"," Hobbies & Leisure"," People & Society"," People & Society Religion & Belief"," News"," Sports Individual Sports Golf"," Home & Garden Yard & Patio"," Food & Drink Restaurants"]}}