{"data":{"0":[{"comment":"Taken from MMA Show #84 w\/Brendan Schaub: \nhttps:\/\/youtu.be\/Frw-IBgu-Qw","label":"failed"},{"comment":"Sean: \"come on hots ones\"\nJoe: \"no\"\nSean: \"apparently fear is a factor for you\"","label":"\/Arts & Entertainment"},{"comment":"Hot ones interviewer is funny and doesn’t ask stupid repeatable questions. He’s does his homework. Rogan needs to get him on. That’d \nbe killer.","label":"\/Arts & Entertainment"},{"comment":"Brendan: \"I love Wings\"\nJoe: \"Wings are overrated\"\nBrendan: \"100%\"","label":"failed"},{"comment":"If Sean Evans would let Joe put hot sauce on Elk loin he'd be there tomorrow.","label":"failed"},{"comment":"“Why ya asking people personal questions while they’re crying”.....offers weed then asks about DMT lol","label":"failed"},{"comment":"the real reason he won't ever do it is because he wants to be the only bald guy in the room","label":"\/Arts & Entertainment"},{"comment":"Joe is totally missing the point on this one.","label":"failed"},{"comment":"Shaub: I love wings\n\nJoe: Wings suck","label":"failed"},{"comment":"Joe has a relationship with elk, dmt and sauna like sophomore girls have a relationship with hydroflasks, starbucks and saving the turtles","label":"failed"},{"comment":"Joe invites Brendan  whenever he wants to have a monologue.","label":"failed"},{"comment":"That’s a long way of saying “I pussed out”.","label":"failed"},{"comment":"'“Why you asking personal questions while people are crying?”.... That's what make the show interesting. To spice it up a bit. Quite literally.","label":"failed"},{"comment":"Brendan is the type of guy to announce that he dropped the soap","label":"failed"},{"comment":"Brendan has become the equivalent of Meg from family guy to JRE.","label":"failed"},{"comment":"This should be called “Why Joe Rogan doesn’t understand Hot Ones”","label":"failed"},{"comment":"So the former host of fear factor won't do hot ones? Kinda funny.","label":"failed"},{"comment":"Joe: \"I don't like it because they ask personal questions with snot coming outta your nose.\"\nAlso Joe: gets Elon Musk blazed, asks him personal questions and makes his stock drop.","label":"\/Arts & Entertainment"},{"comment":"\"Wings have been around forever\"\n\nYea my man ever since shits been flying.","label":"failed"},{"comment":"you know your really Joes friend when he doesn't say \"a buddy of mine\" about you","label":"failed"},{"comment":"Oh he eats jalapenos, everyone watch out for this guy","label":"failed"},{"comment":"Since Joe won’t do Hot Ones he should get Sean Evans on JRE","label":"failed"},{"comment":"I love how all the comments for JRE Clips are just people hating on Joe.","label":"failed"},{"comment":"how to completely miss the point of the show and the 1 thing that makes it unique.... \"you cant talk like that\". it's not about talking, it's about suffering!","label":"\/Arts & Entertainment"},{"comment":"Joe Rogan: \"You need to do difficult things\"\nAlso Joe Rogan:","label":"failed"},{"comment":"Is everyone going let it pass that he was “Ballz deep in a cheese pizza”.","label":"failed"},{"comment":"Joe dont want his fans too see him crying and quitting half way thru.","label":"failed"},{"comment":"Joe Rogan just won’t admit he’s afraid to do so, and he knows he’ll quit not even midway.","label":"\/Arts & Entertainment"},{"comment":"Brendan lost all credibility with “Buffalo stop” lol","label":"failed"},{"comment":"Joe: Why you asking people personal questions while they’re crying?\nAlso Joe: DC what went wrong with your Jon Jones fight?","label":"failed"},{"comment":"Did someone say dudes from Nepal? Damn! I am feeling proud .","label":"failed"},{"comment":"It would be too weird for Joe to be interviewed by his younger self. Understandable","label":"failed"},{"comment":"Joe “I love jalapeños with Elk” Rogan","label":"failed"},{"comment":"He's both so close to understanding and yet totally misses the point haha","label":"failed"},{"comment":"Wouldn’t talking after being punched around for 20 minutes be a worse way to talk than eating hot sauce","label":"failed"},{"comment":"When brennan said \"i love wing dude\", he legit looked like a creepo","label":"failed"},{"comment":"\"why would you ask people personal questions while they're crying?\"-Joe Rogan\n'Daniel Cormier Loses starts to cry'\n\"Daniel give us your thoughts\"","label":"failed"},{"comment":"the entire point is literally the show not being a good way to talk lol","label":"failed"},{"comment":"\"That wing show\" he definitely knows it's called hot ones","label":"failed"},{"comment":"Brendan:  I love wings..\nJoe:  I like Elk\nBrendan:  I fkn loooooove ELK","label":"failed"},{"comment":"“Wings have been around forever” wow","label":"failed"},{"comment":"Joe “I’m glad dmt isn’t spicy” Rogan","label":"failed"},{"comment":"Brendan “I Fuckin’ Love Wings” Schaub","label":"failed"},{"comment":"Joe’s thinking ‘Interviews & DMT?’","label":"failed"},{"comment":"Joe “That stuff keeps you alive” Rogan","label":"failed"},{"comment":"I saw an episode where one guy crapped his pants while eating hot wings!","label":"failed"},{"comment":"Joe, the whole point of Hot Ones is that it's difficult.\n\nAlso\nDO IT","label":"failed"},{"comment":"“Hot Ones” is a great show, nice host, never watched it.","label":"failed"},{"comment":"Joe: \"Habeneros are so spicy.\"\nYeah, he ain't ready for Hot Ones if that's his limit.","label":"\/Arts & Entertainment"},{"comment":"\"balls deep in a cheese pizza\" damn, I'm on keto, and that sounds really good.","label":"\/Food & Drink"},{"comment":"Joe rogan will definitely do the \"DMT ones\"","label":"failed"},{"comment":"The whole point of HotOnes is the hot sauce makes the people he interviews drop their guard because they start to concentrate on the heat instead of saying the same cookie cutter answers.","label":"\/Food & Drink\/Food"},{"comment":"\"That stuff keeps you alive.\" Yes, food.","label":"failed"},{"comment":"“When you eat wings and your lips turn white.”\n\nUhhhh what ?","label":"failed"},{"comment":"Bruh, Hot Ones has like the best interviews ever.","label":"failed"},{"comment":"\"I'm balls deep in a cheese pizza.\"  We've all been there...","label":"failed"},{"comment":"Joe “ I’ll OD on DMT but hot wings is where i draw the line” Rogan","label":"failed"},{"comment":"\"that's not a good way to talk\" That's literally 100% the purpose of the whole thing.","label":"\/Arts & Entertainment"},{"comment":"Joe \"have you ever ate spicy DMT while smoking elk\" Rogan","label":"failed"},{"comment":"Sean doesn't really ask controversial questions. He asks about your past jobs and current hobbies and light stuff like that. Celebrities just tend to volunteer stuff when their faces are melting and they get particularly honest, but not the \"I was molested when I was 3\" levels of honest.","label":"failed"},{"comment":"\"because it's a bad way to do an interview\"","label":"failed"},{"comment":"Joe's two biggest fears: hip hop dance and hot wings","label":"failed"},{"comment":"Shout to WINGS & THINGS in San Diego Cali!! Some of the best big wings I've had.","label":"\/Arts & Entertainment"},{"comment":"“Jalapeño with elk”","label":"failed"},{"comment":"\"I was balls deep in a cheese pizza\" - Brendan Schaub.","label":"failed"},{"comment":"Joe “don’t ask me questions while I’m crying” rogan","label":"failed"},{"comment":"“Why you asking personal questions while people are crying?”\n\nThat’s. LITERALLY. The point of the show.","label":"failed"},{"comment":"\"Balls deep in a cheese pizza\" haha","label":"failed"},{"comment":"And of course “elk” is mentioned yet again, even though the topic was chicken wings.","label":"failed"},{"comment":"“Balls deep in a cheese pizza” -Brandan Shobbb","label":"failed"},{"comment":"The way he said “In that bitch.” 😂","label":"failed"},{"comment":"Joe “I refuse to appear vulnerable on camera” Rogan","label":"failed"},{"comment":"\"Chili My Soul\" sounds super sus","label":"failed"},{"comment":"Why is this showing up on my recommended wtf","label":"failed"},{"comment":"Shawn actually is a great interviewer.. He missing out on this one..","label":"failed"},{"comment":"\"I'm like balls deep in a cheese pizza\". WTF.","label":"failed"},{"comment":"ahhh so he's too chicken","label":"failed"},{"comment":"\"I don't want to because it sounds like a miserable time.\" is totally fair.","label":"failed"},{"comment":"“Wings have been around forever” ty for enlightening us joe","label":"failed"},{"comment":"\"Looking at celebrity Instagrams, balls deep in a pizza like, goddammit!!!\" yeah Brandon, u and the rest of us haha","label":"\/News"},{"comment":"Hot ones is high level question answering with dire physical consiquences","label":"failed"},{"comment":"Joe's reason for not doing hotones is literally the premise of the show...","label":"failed"},{"comment":"\"Have you ever tried jalapeno with elk on DMT though?\"","label":"failed"},{"comment":"\"Im balls deep in a cheese pizza\"","label":"failed"},{"comment":"0:57 Pfft. \"It's not a good way to talk.\" It's a fine way to talk. It's really all about the reaction to Da Bomb anyway.","label":"failed"},{"comment":"Speaking about “Atomic Wings” that spot is awesome!! Lol","label":"failed"},{"comment":"\"That wing show\" he definitely knows it's called hot ones","label":"failed"},{"comment":"I started sweating just watching him talk about going on the show lol.","label":"failed"},{"comment":"It would be awesome to see him on that show\n\"Yeah sniff I'm telling you sniff thats the way I eat elk, Jamie sniff pull that up\"","label":"\/Arts & Entertainment"},{"comment":"PLEASE DO HOT ONES JOE!!!! SEAN EVENS IS GREAT!! YOU WILL LOVE IT","label":"failed"},{"comment":"Joseph “love jalapeño’s with elk” Roggy","label":"failed"},{"comment":"“I like jalapeño with elk” is the most Joe Rogan thing you will ever hear.","label":"failed"},{"comment":"I just want someone to look at me the way Brendan looks at Joe.","label":"failed"},{"comment":"Joe “I can’t go a day without elk” Rogan","label":"failed"},{"comment":"Hot Ones is a great interview platform wtf is he talking about 😂","label":"failed"},{"comment":"talking about wings\n30 seconds later\n\"Yaknow I eat elk right?\"","label":"failed"},{"comment":"Joe “Jalapeño Elk” Rogan","label":"failed"},{"comment":"this is a really weird way of saying that he's intimidated by sean because he's an actually good interviewer","label":"failed"},{"comment":"“Was it purple?!” Bruh it’s not weed! It’s hot sauce hot damn!! 😂🤣","label":"\/Arts & Entertainment"},{"comment":"“Holla-PEEN-yo”","label":"failed"},{"comment":"“It was an awwrange color, a real aawrange color” Damn. I thought habaneros were orange 🤔","label":"failed"},{"comment":"\"Balls deep in a cheese pizza\"\n\nPretty sure Brendan is eating pizza wrong","label":"failed"},{"comment":"Brendan “you would do well at it though :-))))” Schaub","label":"failed"},{"comment":"Joe: Why ask people personal questions while they're crying?\nalso Joe: * interviews DC while crying in the octagon *","label":"failed"},{"comment":"Aaaaaaaand now we need Joe on Hot Ones, Sean go get him!","label":"failed"},{"comment":"Brandon \"I love wings\" Schaub","label":"failed"},{"comment":"Joe: \"Why would you ask personal questions to someone while he cries?\"\n\nAlso Joe: \"Elon, smoke that blunt\"","label":"failed"},{"comment":"Joe \"every time I take a piece of elk I put a piece of jalapeno on that b*tch\" Rogan","label":"\/Arts & Entertainment"},{"comment":"Hot ones are some of the best videos on YouTube, everyone loves them.","label":"failed"},{"comment":"Joe “that wing show” Rogan","label":"failed"},{"comment":"I feel like that “stuff keeps you alive” comment at the end is about elk lol","label":"failed"},{"comment":"Joe: Its not a good way to talk.\n\nEvery Hotones show: Wow man this was a great interview.","label":"\/Arts & Entertainment"},{"comment":"Dude Hot Ones is a great interviewer!","label":"failed"},{"comment":"If the show was called \"hot elk\" he'd do it.","label":"failed"},{"comment":"He's scared of da hot wings..\n\nDon't blame him.","label":"failed"},{"comment":"LOL it's hilarious the things that people said to avoid hot wings\/foods while in fact we all know these people are afraid & a complete  wuss about it.","label":"\/Arts & Entertainment\/Humor"},{"comment":"Joe “I like jalapeños with elk” Rogan","label":"failed"},{"comment":"Damn. I just want to hear Rick Ross say the word “Buffalo”.","label":"failed"},{"comment":"Joe asked the Elk,\" have you ever tried DMT?\" While chopping chile peppers.","label":"failed"},{"comment":"Joe \"I Eat Elk\" Rogan. Me too Joe.","label":"failed"},{"comment":"He needs to do Hot Ones on The Joe Rogan Show. It can be on his turf.","label":"failed"},{"comment":"Brendan seems like the type of guy to go his whole life with a secret gay porn addiction but never actually ended up hooking up with a dude.","label":"\/Arts & Entertainment"},{"comment":"\"Why would you ask guys personal questions while they are crying?\"\nSays the guy who used to ask people personal questions after they just got knocked unconscious 5 minutes prior","label":"failed"},{"comment":"Schaubs voice makes me want to throw up I'm glad his podcast has tanked","label":"failed"},{"comment":"Okay Youtube Recommended, have it your way. I'll watch this damn video.","label":"failed"},{"comment":"Joe “there used to be this place” Rogen","label":"failed"},{"comment":"Joe Rogan: Interviews  Daniel Cormier while he’s crying after getting knocked out \n\nAlso Joe Rogan: “Why you askin people questions while they’re crying”","label":"\/Arts & Entertainment"},{"comment":"Please do hot ones Joe! That's all I need in my life","label":"failed"},{"comment":"Brendan has never said anything I remember or laughed at on any of these podcasts.  He seems like a nice guy but for fuck's sake....","label":"\/Arts & Entertainment"},{"comment":"He'll come around :D","label":"failed"},{"comment":"#Joe #Rogan is afraid. It's the #FEAR #FACTOR in him. I'm addicted to some habanero, jalapeno cheese that my own #Korean mom cannot handle. It has the perfect heat. One thing, I can't figure out  - why they added sodium.... to make people drink \"water\"? Doesn't faze me. What's the next hottest pepper?","label":"\/Food & Drink"},{"comment":"Joe \"Don't ask me personal questions while I'm crying\" Rogan","label":"failed"},{"comment":"Its cause the stool would still be too big. His legs would be swangin. Plus everything is below him.","label":"\/Health"},{"comment":"2:11 Ha La PEEEEEEN Yo!","label":"failed"},{"comment":"DO THE SHOW\nwhen did this come out I thought you did do it. hm lmlook.","label":"failed"},{"comment":"Wings have been around for ever","label":"failed"},{"comment":"Joe “I won’t do anything” Rogan","label":"failed"},{"comment":"\"And your lips go white\" I love wings.... this Brendan dude is dorky lame & he laughs at everything too much but hey we all need a groupie","label":"\/Arts & Entertainment\/Humor"},{"comment":"Joe \"i love jalapenos with elk\" Rogan","label":"failed"},{"comment":"Seriously though Joe...GO ON HOT ONES!!!!","label":"failed"},{"comment":"Schaub: he has elk wings.\n\nRogan: I'll be there in the morning.","label":"failed"},{"comment":"Joe: do things out of your comfort zone\n\nAlso Joe: I don’t wanna be out of my comfort zone. Dont make me dance or eat hot stuff.","label":"failed"},{"comment":"He doesn’t want to do it because fear is DEFINITELY a factor for Joe","label":"failed"},{"comment":"DMT FLAVORED HOT SAUCE and he’ll go","label":"failed"},{"comment":"Joe “jalepeeeno” rogan","label":"failed"},{"comment":"DO IT JOE! Life challenge! It'd be\/You'd be, brilliant!","label":"failed"},{"comment":"“Why are you asking people personal questions while they’re crying” says the guy that interviewed DC like 2 minutes after getting knocked out lol","label":"failed"},{"comment":"Interviewing someone while they’re eating super hot wings is brilliant, because that pain brings down barriers and reveals who they really are. Just need to make sure to ask better interview questions than Joe does. Sorry, I like JR a lot, but he sometimes he doesn’t strike me as the sharpest knife in the set.","label":"failed"},{"comment":"That's literally the point of the show, Joe","label":"failed"},{"comment":"❗️I need to see him on hot ones ❗️","label":"failed"},{"comment":"My uncles from Nepal and while he was talking about that I was literally like no he could eat that","label":"failed"},{"comment":"Joe “I like jalapeños with elk” Rogan","label":"failed"},{"comment":"I like how he talks about this but was a host of fear factor lmao","label":"failed"},{"comment":"<3","label":"failed"},{"comment":"Joe needs to be hypnotized ....(at least) into doing the show. Been waiting for years!!!","label":"\/Health"},{"comment":"That 'wing show' lol","label":"failed"},{"comment":"If David Goggins did Hot Ones....\n\nJoe Rogan: It's an amazing challenge where your brain is fighting your senses. It's really an incredible thing to see.","label":"\/News"},{"comment":"Other guy kinda sus no?\n\n\"Balls deep in a pizza\"","label":"failed"},{"comment":"Joe “jalapeño” Rogan","label":"failed"},{"comment":"Got a Spotify add before this video saying joe “have you tried elk” Rogan will be on Spotify. We all know it’s joe “have you done dmt before” rogan","label":"\/Arts & Entertainment\/Online Media"},{"comment":"\"Suicide\" sauce was orange and likely habanero? Thats adorable lol.","label":"failed"},{"comment":"The last dab with Joe isn’t done with hot sauce y’all...","label":"failed"},{"comment":"Joe \"i invite my less famous friends on my podcast to help em out\" Rogan","label":"failed"},{"comment":"Why is Brendan looking at joe like that 😂","label":"failed"},{"comment":"Joe \"I won't do anything I won't profit off\" Rogan","label":"failed"},{"comment":"I've had to sign a waiver for hot wings before, it was one thing eating them.... it was another shitting it out the next couple days...\n\nEdit: you hope the water splashes back up!","label":"failed"},{"comment":"\"It's not a good way to talk.\" Translation: \"I can't handle it and wouldn't be able to maintain this persona I've cultivated here on my podcast.\"","label":"failed"},{"comment":"You should try it at least once. It'd be hilarious. I think you'd do well.","label":"\/Arts & Entertainment\/Humor"},{"comment":"“Balls deep in a cheese pizza” my new tinder bio","label":"failed"},{"comment":"I know exactly which place he’s talking about haha I was there a week ago when I went to Boston near Belmont, I ordered the suicide as well and couldn’t even finish the first one! Haha","label":"failed"},{"comment":"As much as I love Joe he’s honestly a hater Om the wing show","label":"failed"},{"comment":"Joe “I’m too afraid to go on hot ones” Rogan","label":"failed"},{"comment":"I got the vibe that Joe looks down on Hot Ones, \"that wing show\". like bro get over yourself, you bring on nasa scientists and ask them how fire works.","label":"\/Arts & Entertainment"},{"comment":"Joe you should do it, especially since you work out","label":"failed"},{"comment":"“It’s not a good place to talk.” Yeah, that’s kinda the point, Joe...","label":"\/Arts & Entertainment"},{"comment":"Joe would make a juicy meme if he went on that show","label":"failed"},{"comment":"Halle Berry did Hot Ones like it was nothing straight beast mode.","label":"failed"},{"comment":"Joe ‘wings have been around forever’ Rogan","label":"failed"},{"comment":"ffs just do it Joe. Sean Evans is a phenomenal interviewer","label":"failed"},{"comment":"Joe “ Jalapiños” Rogan","label":"failed"},{"comment":"Joe \"I eat elk\" Rogan","label":"failed"},{"comment":"Would love to see Joe on Hot Ones, featuring elk wings with a DMT glaze.","label":"failed"},{"comment":"Love the comments on this video 😂","label":"failed"},{"comment":"Joe \"I Eat Elk\" Rogan","label":"failed"},{"comment":"Thank God Joe hasn't conceded to that meme level silliness.","label":"failed"},{"comment":"Hot Ones is a great show. Im always blown away how great of an interviewer Sean is.","label":"failed"},{"comment":"The reason Joe doesn’t want to do the show is the whole purpose of why the show exists in the first place. lol","label":"\/Arts & Entertainment"},{"comment":"I would love to see Joe on Hot Ones!","label":"failed"},{"comment":"I must’ve missed when joe said wings are overrated","label":"failed"},{"comment":"Ffs Joe , elk’ rogan- man, you slipped the ol’ elk talk in there ...again","label":"failed"},{"comment":"He should do it man, it would easily be one of the most viewed Hot Ones.","label":"failed"},{"comment":"Joe “I only like jalapeños with elk” Rogan.","label":"failed"},{"comment":"He’s scared of the wings","label":"failed"},{"comment":"“Why ask personal questions when someone’s crying” but he talked to Daniel Cormier after he lost to jon Jones while he was crying lolololol","label":"\/People & Society"},{"comment":"Joe “I eat Elk” Rogan","label":"failed"},{"comment":"\"jalapino\"","label":"failed"},{"comment":"\"why you asking people personal questions while their mouth is on fire\" \nJoe *literally* interviews people after they got their face smashed in","label":"failed"},{"comment":"I would love to see a joe rogan podcast featuring Sean Evans !!","label":"failed"},{"comment":"Lmao when Joe said Nepali guy eat off the chart spicy plus extra spicy 😂","label":"failed"},{"comment":"Joe making me wanna try elk 😂😂😂","label":"failed"},{"comment":"Joe \"wings have been around forever\" rogan.","label":"failed"},{"comment":"The reason he asks those questions with the hot wings is to knock the the facade people put on for public and it get a real answer and see what the persons really like come on joe get o hits one tommy and Bert have both done it","label":"\/Arts & Entertainment"},{"comment":"First clip ive seen of joe rogan’s podcast. Meh, i guess im glad i dont watch it","label":"\/Arts & Entertainment"},{"comment":"JOE! YOU GOTTA DO IT!","label":"failed"},{"comment":"You'll get what's coming to you, Gregory Linton. God is telling me everything. Now you know people like me exist. You can't hide","label":"\/Arts & Entertainment"},{"comment":"Shoutout to Chili My Soul in Encino. Old school spot that closed years ago","label":"failed"},{"comment":"I understand that Rogan is scared, but he doesn't have to throw shade at Sean's whole set-up.","label":"\/Arts & Entertainment\/Humor"},{"comment":"He’s talking about Atomic Wings at Down the Hatch on 4th...spent a lot of days and nights there.","label":"\/Arts & Entertainment"},{"comment":"Weed and wings, perfect combo, do dat shit foo","label":"failed"},{"comment":"Season the wings with some DMT and CBD oil and Joe will do it.","label":"failed"},{"comment":"Damn Joe just do it","label":"failed"},{"comment":"Rogan: let's get high af before this podcast. \n\nAlso rogan: eating hot sauce while talking isnt the way to go man","label":"\/Arts & Entertainment"},{"comment":"That’s totally how I serve elk too...😶","label":"failed"},{"comment":"I love hot wings, the pleasure pain you experience is the endorphins being released in your brain to combat the burning sensation, your body thinks that you poured boiling water in your mouth so it’s trying to ease the pain.","label":"failed"},{"comment":"FCKN DO IT 🤣🤣🤣 Im excited for Tom Segura!!!!","label":"failed"},{"comment":"I’m sad that he can’t see the genius in hot ones.","label":"failed"},{"comment":"“He owns like a hundred B u f f a l o S t o p s “","label":"failed"},{"comment":"WTF...was that a Dj Khalid vibe from Joe \"Trips guests with weed\" Rogan? I hope he was not serious","label":"\/Arts & Entertainment"},{"comment":"Boo, DO IT!","label":"failed"},{"comment":"Do it, Joe!","label":"failed"},{"comment":"He might be talking about wings to go I’m from Baltimore and we had one there when I was a kid and I had the suicide wings","label":"failed"},{"comment":"Joe “ Too Hollywood for Hot Ones” Rogan","label":"failed"},{"comment":"I've also heard that eating an elk is like eating a super athlete.  Almost positive that I heard it from Carlos Mencia.","label":"\/Arts & Entertainment"},{"comment":"Joe “Jalapeños with Elk” Rogan","label":"failed"},{"comment":"“Jalapaiños”","label":"failed"},{"comment":"You want good wings, come to Buffalo, NY where the wing was invented! Best wings in the world!","label":"failed"},{"comment":"Joe “wing have been around forever” Rogan","label":"failed"},{"comment":"Joe: wanna smoke this blunt while i ask you personal questions?","label":"failed"},{"comment":"I used to work at Wingstop. I was on my break trying to eat the atomic wings. I got punked by a 12-year-old who stopped  by to watch me. My pride.","label":"failed"},{"comment":"I'd love to see joe on other shows","label":"failed"},{"comment":"not a good way to talk? bro, his interviews are legendary. get over it, you're just scared. do it. do it. do.... it.","label":"failed"},{"comment":"Roe Jogan: \"DMT's ego death is the most frightening experience\"\n\nAlso Joe Logan: \"Can't handle, too spicy\"","label":"\/Sensitive Subjects"},{"comment":"We need to start a petition for Joe Rogan to do the Hot Ones and talk about DMT while his face is melting","label":"\/People & Society\/Social Issues & Advocacy"},{"comment":"I thought that was a photoshop of him doing it in the thumbnail","label":"failed"},{"comment":"Joe would bring elk with him on hot ones as a food to take away the heat","label":"failed"},{"comment":"“Balls deep into a cheese pizza”","label":"failed"},{"comment":"If there was DMT on the wings, he'd be on in a heartbeat.","label":"failed"},{"comment":"“Balls deep in a cheese pizza","label":"failed"},{"comment":"hey is it just my thought or is he high? :DD","label":"failed"},{"comment":"I enjoy watching the show.","label":"failed"},{"comment":"Guy Fiery is the champ, check out his 'drop mic' moment!","label":"failed"},{"comment":"Imagine if joes wife read this title. Bit of a confidence shake.","label":"failed"},{"comment":"Ahhhhhh so hungry now 😂","label":"failed"},{"comment":"do it Joe, DO IT!","label":"failed"},{"comment":"Do it, Joe!","label":"failed"},{"comment":"Well that just sounds like being scared with extra steps","label":"failed"},{"comment":"Feels like Brendan flirts with Joe with his comebacks","label":"failed"},{"comment":"You should have Johnny Scoville in your show. He seems like a really interesting guy!!!\nCheck out “Chasing the Heat” on the tube!!","label":"\/Arts & Entertainment"},{"comment":"Joe \"Jalapeno with Elk\" Rogan","label":"failed"},{"comment":"When you post it and I’m balls deep in a cheese pizza hahahaha","label":"failed"},{"comment":"Brendan: It takes your breath away. Your lips go white. \nMe: That was gay as F...! Hahahaaaa!!","label":"failed"},{"comment":"\"Joe did you know that extremely high concentrations of capsaicin have been reported to have hallucinatory effects?\"\n\"Hit me with that 9 million scoville fam\"","label":"\/Food & Drink"},{"comment":"Maybe he’ll do it if they made deep fried elk testicles 🤷🏽‍♂️","label":"failed"},{"comment":"Turned off soon as I seen Brendan Brown Nose ffs!","label":"failed"},{"comment":"Dmt sauce on the wings","label":"failed"},{"comment":"1:00 well thats the whole point of hot ones.","label":"failed"},{"comment":"sometimes i get a little crazy and put some salt on my fries","label":"failed"},{"comment":"0:50","label":"failed"},{"comment":"Joe did the hotbox where he was so high he couldn’t function tho lol","label":"failed"},{"comment":"I remember while on trekking in Nepal. I would see all the foreigners shocked seeing us having our regular  meal.","label":"\/Travel"},{"comment":"00:49  joe explains BDSM wings","label":"failed"},{"comment":"Joe would partake if they started a High Ones.\n\nAfter each question they would need to take another gram of mushrooms.","label":"failed"},{"comment":"Joe \"I eat elk\" Rogan","label":"failed"},{"comment":"A hint of jealousy hmmm thats weird coz hot ones is legit pretty pretty damn good tbf","label":"failed"},{"comment":"Shoutout to Nepal 🤙🏽","label":"failed"},{"comment":"I’m a wing assassin I love me some wings","label":"failed"},{"comment":"I want Joe Rogan on hot ones SO BAD!!!!!","label":"failed"},{"comment":"1:48  yay joe mentioning my country","label":"failed"},{"comment":"“Balls deep in a cheese pizza”...won’t lie. I’ve been on the internet a long time and that’s a new one.","label":"\/Food & Drink\/Restaurants"},{"comment":"The point of the hot wings is to keep you uncomfortable and on edge, makes things unpredictable","label":"failed"},{"comment":"Just one of the few times i don’t agree with Joe😂😂","label":"failed"},{"comment":"Title: Why Joe Rogan won't do hot ones\n\nTomorrow: joe rogan pisses his pants over hot wings😆","label":"\/Arts & Entertainment"},{"comment":"joe \"jalpeño on elk\" rogan","label":"failed"},{"comment":"FIRE WINGS IN SACRAMENTO HAVE THE BEST WINGS EVER CHANGE MY MIND YOU CAN'T!!!","label":"failed"},{"comment":"He refuses to ever be laughed at. Sinsecure","label":"failed"},{"comment":"I have been thinking about this for a couple years. Come on Joe, do HotOnes...","label":"failed"},{"comment":"Joe “they won’t let me do dmt on hot ones” Rogan","label":"failed"},{"comment":"Joe. Do Hot Ones. Please. My two favorite shows combined. That's all.","label":"failed"},{"comment":"Brendan: \"I was balls deep in a cheese pizza\"\nJoe: \"No you weren't\"\nBrendan: \"100%\"","label":"failed"},{"comment":"Do it Joe! And then leg kick the wing table in the end or tap him out! I would love it. Or to really make it funny have Dave Chapelle play the infamous crackhead from Fear Factory stop you from eating the wings and eat them for you. Just silly stuff.","label":"\/Arts & Entertainment"},{"comment":"Joe been living in California forever now and still don’t know how to pronounce jalapeño?","label":"failed"},{"comment":"Joe it's okay to be scared of \"Da Bomb\" hot sauce. Just be honest with us. Not mad at you. Just dissapointed.","label":"failed"},{"comment":"Lmao lame reason he just cant take the heat! Haha 😜","label":"failed"},{"comment":"I would love to see joe on hot ones","label":"failed"},{"comment":"Joe\" you should try elk\" Rogan","label":"failed"},{"comment":"Rogan is obsessed with that DMT bs but he’s scared of some spicy wings lmfao 😂😂💀💀🚮","label":"\/Arts & Entertainment"},{"comment":"Ok Joe Rogan is definitely going on Hot Ones now.","label":"failed"},{"comment":"Is it a flex to eat elk like goddamn that's all Joe talks about,Elk,elk,elk!!!😂😂","label":"\/Arts & Entertainment\/Humor"},{"comment":"Bro Jamie knows so many random facts.. always checking everybody on everything.","label":"failed"},{"comment":"Who immediately regretted clicking on this right after seeing schaub?","label":"failed"},{"comment":"He’s s’scared","label":"failed"},{"comment":"No shit Joe, the show isn’t about the ‘best way to have a conversation’. Its meant to be entertaining and different.","label":"\/Arts & Entertainment\/Music & Audio"},{"comment":"Brendan \"balls deep in a cheese pizza\" schaub","label":"failed"},{"comment":"Of course elk comes up 😂","label":"failed"},{"comment":"Do it. \n\nDO IT!!!","label":"failed"},{"comment":"Someone says literally anything...\nJoe Rogan: “Yeah but have you ever tried ELK while on DMT?”","label":"failed"},{"comment":"\"balls deep in a cheese pizza\" why do I feel Brendan meant that literally","label":"failed"},{"comment":"You do you, Joe, but it would sure be nice to see 2 bald guys sweating it out over some of the hottest wings on the internets.\n\nJust saying.","label":"\/Arts & Entertainment"},{"comment":"I wonder if Joe has ever eaten Elk? 🤣😂🤣","label":"failed"},{"comment":"2:13 The only thing Schaub is balls deep in is his Joe Rogan blow-up doll.","label":"\/Arts & Entertainment"},{"comment":"DO IT, JOE! HOT ONES! WHOO!","label":"failed"},{"comment":"Joe “I got elk in the freezer” Rogan","label":"failed"},{"comment":"We need to pressure him into doing it","label":"failed"},{"comment":"I would love to see on Joe on Hot Ones","label":"failed"},{"comment":"without watching the video im gonna go out on a limb here and say he wont go on hot ones cuz he is not one haha gotem","label":"\/Arts & Entertainment"},{"comment":"Talking about hot ones\n0:56 - 1:22","label":"failed"},{"comment":"Joe \"im scared Sean Evans is a better interviewer than me\" Rogan","label":"failed"},{"comment":"Do it!*","label":"failed"},{"comment":"Do hot ones ffs!! That shit would be awesome","label":"failed"},{"comment":"Joe that's the whole point of the show my dude!!!! You and Sean could even rip some fat bong hits before the show starts!!! You should absolutely do it and don't be a pussy when it gets hot!","label":"\/Arts & Entertainment"},{"comment":"truth: peppers keep you alive","label":"failed"},{"comment":"Joe Rogan should interview people while eating DMT chilly elks and playing Quake.","label":"failed"},{"comment":"Brendan \"Was it purple seeds\" Schaub","label":"failed"},{"comment":"that’s really the reason? lmao okay i guess","label":"failed"},{"comment":"Do It!!!!","label":"failed"},{"comment":"Shaub eyes bones Rogan when he stares at him","label":"failed"},{"comment":"Sean Evans is a damn good interviewer besides the chicken wings and shit. He researches like crazy","label":"failed"},{"comment":"I honestly think the reason hot ones is successful is it's \"acceptable\" torture content.\nThat and hot sauce euphoria.","label":"failed"},{"comment":"if they did dmt wing jow would be downnn","label":"failed"},{"comment":"this would end with him talking about elk","label":"failed"},{"comment":"Best wings I ever had is when I went to midwest to visit ( wi)\nTheirs a wing place called \" legend larry's\" they have different hot sauces some hotter than others.. Their doa hot sauce is their hottest and tates Good af..\nMaybe it was the hot sauce that made the wings taste so good who knows but those wings with that sauce was bangin","label":"failed"},{"comment":"It’s not even a joke when people say he brings up elk in almost every podcast 😂😂","label":"failed"},{"comment":"HAL-EY-PEEN-YO’S","label":"failed"},{"comment":"Quit being a weakling and just do it Joe - you know you'd get more fan service out of that one episode than the majority of other randos you host","label":"\/Arts & Entertainment"},{"comment":"You really need to do it Joe. Honestly. I mean... unless you’re scared. 🤷🏼‍♂️ Seems like you’re scared. 😏","label":"failed"},{"comment":"Man all you had to do was say wings and my mouth started watering and now I have an order placed lmao","label":"failed"},{"comment":"Joe doesn’t have the balls to go on Hot Ones.","label":"failed"},{"comment":"Just do Hot Ones, damn it.","label":"failed"},{"comment":"Joe would be great on Hot Ones. This got me thinking, who would be the best guest possible on Hot Ones dead or alive? And who did i come up with....... Marlon Brando haha.","label":"\/Arts & Entertainment"},{"comment":"Amazingly they don't talk about Joey Diaz being on Hot Ones","label":"failed"},{"comment":"look at these guys talking about food like that. Makes my mouth wet","label":"failed"},{"comment":"‘Why you asking personal questions while they’re crying’ is literally the reason why it’s so successful","label":"failed"},{"comment":"that's his reasoning? weakkkkkk","label":"failed"},{"comment":":)","label":"failed"},{"comment":"I've never felt uncomfortable listening to someone talk about food until I heard Schaub talk about wings","label":"failed"},{"comment":"I think Joe would be perfect for hot ones!","label":"failed"},{"comment":"Sean Evans: So when did you realize you were gonna be bald forever?\nJoe Rogan: Crying from wing. Coughing up blood\nHow dare you....","label":"\/Arts & Entertainment"},{"comment":"Nepal 🇳🇵 : we want your entire stock 🤣","label":"failed"},{"comment":"Joe's scared!!","label":"failed"},{"comment":"I think I remember hearing somewhere that eating jalapenos are like eating a vegetable super athlete.","label":"failed"},{"comment":"Joe would go on it if they did it with Elk meat or it was a DMT trip show","label":"failed"},{"comment":"Joe doesn’t want to go on Hot Ones because he doesn’t want to get interviewed by a true champ!","label":"failed"},{"comment":"Brendan wants to replace the word wings with you soooo bad. Look at that mugg just begging","label":"failed"},{"comment":"i bet he would do hot ones if he was on dmt","label":"failed"},{"comment":"I bet you he would go on Hot Ones just to try it out of curiosity lol or if he lost a bet 😂","label":"\/Arts & Entertainment"},{"comment":"Joe get on hot ones ffs. We all want to see it!","label":"failed"},{"comment":"Joe \"I Love HollaPeeñoes\" Rogan","label":"failed"},{"comment":"2:12 Oh brendan....why do you always try too hard to be funny and end up cringing everybody?","label":"\/Arts & Entertainment"},{"comment":"I'd bet he would do it if they got in some elk meat and DMT","label":"failed"},{"comment":"Do Hot Ones JR! Spice it up! You ain’t no puzzy! DO IT!","label":"failed"},{"comment":"coming from the fear factor guy lol","label":"failed"},{"comment":"“Its not a good way to talk man”\nThats the premise of the show Joseph\n😂😂😂","label":"\/Arts & Entertainment"},{"comment":"Joe: I love spicy \nAlso Joe: I love jalapeños","label":"failed"},{"comment":"I have like freezers full of elk. By the way, Have you ever tried DMT?","label":"failed"},{"comment":"Do it!!! common do it!!","label":"failed"},{"comment":"Speaking my language rogan","label":"failed"},{"comment":"\"Why you asking people personal questions while they're crying?\" How does a comedian not understand that its funny?","label":"\/Arts & Entertainment"},{"comment":"Hot Ones is the best show!!!","label":"failed"},{"comment":"Joe: its just not a good place to talk \nFirst we feast: same number of subs as JRE","label":"failed"},{"comment":"Ask the majority of guests who have been on Hot Ones, and they'll tell you that it's an interesting, fun, and entertaining experience. Sean Evans, the host, is a big reason for it, too. Asks interesting questions, keeps the convo moving. Really good host.","label":"\/Hobbies & Leisure"},{"comment":"Joe's kinda shittingnon a great idea. Hes just mad it didnt take hot ones 10 years to blow up 👀","label":"failed"},{"comment":"Never heard \"balls deep\" and \"cheese pizza\" mixed together.","label":"failed"},{"comment":"Wow, way off the mark. Hot Ones is a brilliant concept. Sean Evans is a fantastic interviewer.","label":"\/Arts & Entertainment"},{"comment":"Joe just seems jealous he didn’t think of the idea first","label":"failed"},{"comment":"if they made elk wings joe would be on the show in a second","label":"failed"},{"comment":"come on joe do the show","label":"failed"},{"comment":"\"I'll interview people on weed but hot wings is too much for me.\"","label":"failed"},{"comment":"They both sound like they just took a bump lol","label":"failed"},{"comment":"joe \"peice of elk\" rogan","label":"failed"},{"comment":"\"i like spicy\" \n\"i like jalapeno\"\nJalapeno aren't spicy for christ sake","label":"failed"},{"comment":"Some elk nachos w jalapeños and Fresno peppers 🔥","label":"failed"},{"comment":"Joe\"I'll get stoned af and wear a space suit during an interview but eating hot wings is out of the question!\" Rogan","label":"failed"},{"comment":"Do it Rogan!!!! Come on dude!!!!!! Do it!!!","label":"\/Arts & Entertainment\/Humor"},{"comment":"Be a Man, You....be a MAN JOE","label":"failed"},{"comment":"Yes chili my soul I remember! Try thai curry or thai papaya salad. It's a mixture of spicy,  sweet, and sour.. their's a balance.  So good. It's not overwhelming spicy, trust me 😁😁😁😁","label":"\/Food & Drink\/Cooking & Recipes"},{"comment":"This had nothing to do with Hot Ones the hot wing show","label":"failed"},{"comment":"Brendan “Balls deep in a cheese pizza” Schuab","label":"failed"},{"comment":"Everyone knows Joe would pull a DJ Khaled 😂","label":"failed"},{"comment":"I think it's because you get a certain kind of \"high\" when something is super hot. That might make the conversations interesting.","label":"failed"},{"comment":"do it do it joe! haha","label":"failed"},{"comment":"It had a really AH RINGE COLOR","label":"failed"}]},"labels":{"0":["failed","\/Arts & Entertainment","\/Food & Drink","\/Food & Drink\/Food","\/News","\/Arts & Entertainment\/Humor","\/Health","\/Arts & Entertainment\/Online Media","\/People & Society","\/Sensitive Subjects","\/People & Society\/Social Issues & Advocacy","\/Travel","\/Food & Drink\/Restaurants","\/Arts & Entertainment\/Music & Audio","\/Hobbies & Leisure","\/Food & Drink\/Cooking & Recipes"]}}