{
"comment": {
   "1":"  Node.js is an open-source, cross-platform JavaScript run-time environment that executes JavaScript code outside of a browser.\n\nLearn all about Node.js in the full course for beginners.\n\n🔗Install Node.js: ",
   "2":" I Would just like to thank FreeCodeCamp for giving me the honor of having my video on here. \nIf you guys have any questions what so ever feel free to ask me on my youtube channel.\nhttps:\/\/www.youtube.com\/noobcoder\nOr post your questions here. I'll come here every so often to try to answer as many questions as possible.",
   "3":" I will feel guilty if I don't press a like for this video after watching for 2 hours...",
   "4":" I wish you'd somehow reduce the text size and closed the terminal if not being used. It was hard keeping track when you only see 5-6 lines of code in preview. Nonetheless, it was pretty great and pretty clear.",
   "5":" It's given me a great start in node.js. Great stuff!!",
   "6":" My God, Its 2020, you are still saving lives... God Bless you brother...",
   "7":" Thanks a ton for this! Just what I needed! I was literally speaking to friend yesterday that I am planning to learn Node.js. Looking forward! :)",
   "8":" Finally, I could wrap my head around NodeJS! Thank you very much...",
   "9":" Hey guys when you get to this part `what is ${ num1 } +${ num2 }? \\n`,     don't use the regular apostrophe. if you wan to include a variable in your string use the key to the left of number one. i missed when he said that. I will be leaving solutions to problems i find in comment replys to this one. please check them out.",
   "10":" Bro went from basic to classes faster than I can follow.",
   "11":" So thankfull if this free :')",
   "12":" Thanks so much for the tutorial, loved how you gave motivation behind everything you thought.\n\nWould be great if the source code could be made available for those who are coding along, since you don't show some of your html files.",
   "13":" concise, neat, all in one to jumpstart using Node! I reeeeeeeeealllllllllllllllly love it! :O",
   "14":" We just need more people like you.",
   "15":" I totally recommend this video!!! Thank you for teaching Vanilla node.js !!",
   "16":" Great tutorial video Pedro. Learned a lot.",
   "17":" Just 14 mins into this video, I completely feel this is the best video for beginners out there who wish to learn node.js without much coding experience. Not all the highly viewed videos or highly liked videos are so understandable as this one.",
   "18":" thank you (:" ,
   "19":" thanks for uploading node.js",
   "20":" Great tutorial, thanks much :)",
   "21":" Best nodejs tutorial ever!",
   "22":" A much needed course for every node.js beginner",
   "23":" 1:15:10 Google says Happy Teachers Day while Pedro is teaching us. :)",
   "24":" I love the voice!",
   "25":" Thank you for the great video!",
   "26":" Non ad video i love that",
   "27":" this video is really lit1 thanks alot!",
   "28":" Love the video. Keep it going.",
   "29":" Thank you very much for this tutorial, helped me a lot to get started, didn't stop for anything, very well explained!",
   "30":" Brilliant! Expands on what really happens under the hood when you use your favourite libraries.",
   "31":" Great video! Very useful! Thank you :)",
   "32":" Amazing. Thank you guys!!!",
   "33":" It would help a lot if there was a link to all these exercises on GitHub.",
   "34":" one of the best tutorials I've seen for any language... very level appropriate for those coming from other languages.  I have experience in BASIC, perl, python, C, C#, and some C++ and this clearly delineates the structure, typing, and syntax of the language fairly quickly (at least if you watch it at 2x like I did?)",
   "35":" Isn't the req.body already in json?",
   "36":" Thank you so much for this tutorial :)",
   "37":" Really Helpful video on Nodejs. Watched without any break and didn't feel bore. learned a lot. thanks alot sir. appreciated",
   "38":" thank you so much....please keep uploading such tutorials",
   "39":" Thank you for this wonderful  tutorial!!!",
   "40":" Lovely tutorial! Thanks a lot!",
   "41":" I've been using node for quite a while, but this is a very helpful refresher. Thank you!",
   "42":" 4:29 another trick to do this is going to your requested path, and type cmd where the file location is and hit enter :) this opens a cmd in the current directory ur in.",
   "43":" It's nice when someone takes a step back now and then to explain WHY we are doing something. You do that very well.",
   "44":" I would like to thank you for your awesome tutorial.\nYou make it really easy to understand and not boring at all.\nPlease keep going you're doing great !!!",
   "45":" Thank you! Great lesson! \nsorry buy it's hard to follow you with this type of screen(only couple line of code on whole screen...)",
   "46":" Hello, Thank you for sharing video. Could you please share the code on Github so we can download it.",
   "47":" Best node.js tutorial ever! Until I found this, everything looked like very complicated about node.js. But this is very simple and clean. Thank you so much Pedro",
   "48":" Thanks a ton!",
   "49":" thanks a lot!",
   "50":" All that to print Pedro....\nThanks for the knowledge I will be learning more about this in time.",
   "51":" Awesome video. Thank you so much for this video. I would love to see more videos on this topic from you.",
   "52":" very nice video it helped me to shift from python backend development to nodejs backend",
   "53":" thanks for this",
   "54":" fantastic tutorial..!!",
   "55":" Your tutorial is awesome. Thank you NoodCoder",
   "56":" For anyone who might not be able to run it after installing. Make sure to set your variable path. Probably the most important part",
   "57":" Great video to watch at 1.5x speed, the talking pace was a bit slow. Good content though.",
   "58":" Great course! well explained",
   "59":" it would have been relly helpful if the codes were given",
   "60":" Everyone, for when doing ejs you have to do npm install ejs in order for it to work properly.",
   "61":" Hey, nice video about the readline module. If you enter Ctrl + C in the command line it triggers the rl.on(\"close\") event, and then go on saying you are correct. I think you can correct this by creating a child class and editing the close event call back and you can pass a parameter to know where it was fired from. Get it??",
   "62":" Okay I got lost at the event thing lol",
   "63":" perfect Tutorial , thanks too much",
   "64":" how to allow the module version update for major version in package.json?",
   "65":" Literally one of th ebest node  tutorial...Thanks dude....YOu're great..!!",
   "66":" 1:10:26 classic winrar",
   "67":" great video! Are there any other server side validation packages as joi is deprecated?",
   "68":" (1:07:37) The path for the file to be piped with the readable stream must be relative... Else it won't work (tested with Node.js 15)",
   "69":" I have windows 10 pro and I want to find the directory through documents but the layout is different because I recently had a computer upgrade so my documents don't look like this. So I can't find the URL to the directory on the top like how you did where can i find it?",
   "70":" Your tutorial is awesome, not only nodejs, we can learn alot more. Thanks million!",
   "71":" I love bananas, too, brother",
   "72":" Thank you! Great lesson!",
   "73":" Thank you this was very useful",
   "74":" Thank you.",
   "75":" Hey !! It's an amazing tutorial , u example very good , amazing",
   "76":" what extensions do you use for auto-completion and suggestions?",
   "77":" well, it is good that the code is readable.We can see every thing;",
   "78":" Best tutorial that what do i say............",
   "79":" i saw this vid on 1.5 speed until i got to the last 3 min, i got so used to u on speed that u sounded drunk on normal speed lol.\nanyway great job on this tut really like that u dived more then the other usual express\/node tut here in youtube. ",
   "80":" 04:23",
   "81":" @2:39 Actually, ctrl+` (the button above the 'tab' key) will also bring up the terminal."},"rep_comment":{"1":" Node.js is an open-source, cross-platform JavaScript run-time environment that executes JavaScript code outside of a browser.\n\nLearn all about Node.js in the full course for beginners.\n\n🔗Install Node.js: ",
      "2":" I Would just like to thank FreeCodeCamp for giving me the honor of having my video on here. \nIf you guys have any questions what so ever feel free to ask me on my youtube channel.\nhttps:\/\/www.youtube.com\/noobcoder\nOr post your questions here. I'll come here every so often to try to answer as many questions as possible.",
      "3":" I will feel guilty if I don't press a like for this video after watching for 2 hours... I will feel guilty if I don't press a like for this video after watching for 2 hours...",
      "4":" I wish you'd somehow reduce the text size and closed the terminal if not being used. It was hard keeping track when you only see 5-6 lines of code in preview. Nonetheless, it was pretty great and pretty clear.",
      "5":" It's given me a great start in node.js. Great stuff!! It's given me a great start in node.js. Great stuff!! It's given me a great start in node.js. Great stuff!! It's given me a great start in node.js. Great stuff!!",
      "6":" My God, Its 2020, you are still saving lives... God Bless you brother... My God, Its 2020, you are still saving lives... God Bless you brother...",
      "7":" Thanks a ton for this! Just what I needed! I was literally speaking to friend yesterday that I am planning to learn Node.js. Looking forward! :)",
      "8":" Finally, I could wrap my head around NodeJS! Thank you very much... Finally, I could wrap my head around NodeJS! Thank you very much... Finally, I could wrap my head around NodeJS! Thank you very much... Finally, I could wrap my head around NodeJS! Thank you very much...",
      "9":" Hey guys when you get to this part `what is ${ num1 } +${ num2 }? \\n`,     don't use the regular apostrophe. if you wan to include a variable in your string use the key to the left of number one. i missed when he said that. I will be leaving solutions to problems i find in comment replys to this one. please check them out.",
      "10":" Bro went from basic to classes faster than I can follow. Bro went from basic to classes faster than I can follow. Bro went from basic to classes faster than I can follow. Bro went from basic to classes faster than I can follow.",
      "11":" So thankfull if this free :') So thankfull if this free :') So thankfull if this free :') So thankfull if this free :') So thankfull if this free :') So thankfull if this free :') So thankfull if this free :') So thankfull if this free :')",
      "12":" Thanks so much for the tutorial, loved how you gave motivation behind everything you thought.\n\nWould be great if the source code could be made available for those who are coding along, since you don't show some of your html files.",
      "13":" concise, neat, all in one to jumpstart using Node! I reeeeeeeeealllllllllllllllly love it! :O concise, neat, all in one to jumpstart using Node! I reeeeeeeeealllllllllllllllly love it! :O",
      "14":" We just need more people like you. We just need more people like you. We just need more people like you. We just need more people like you.",
      "15":" I totally recommend this video!!! Thank you for teaching Vanilla node.js !! I totally recommend this video!!! Thank you for teaching Vanilla node.js !! I totally recommend this video!!! Thank you for teaching Vanilla node.js !! I totally recommend this video!!! Thank you for teaching Vanilla node.js !!",
      "16":" Great tutorial video Pedro. Learned a lot. Great tutorial video Pedro. Learned a lot. Great tutorial video Pedro. Learned a lot. Great tutorial video Pedro. Learned a lot.",
      "17":" Just 14 mins into this video, I completely feel this is the best video for beginners out there who wish to learn node.js without much coding experience. Not all the highly viewed videos or highly liked videos are so understandable as this one.",
      "18":" thank you (: thank you (: thank you (: thank you (: thank you (: thank you (: thank you (: thank you (: thank you (: thank you (: thank you (: thank you (: thank you (: thank you (: thank you (: thank you (:" ,"19":" thanks for uploading node.js thanks for uploading node.js thanks for uploading node.js thanks for uploading node.js thanks for uploading node.js thanks for uploading node.js thanks for uploading node.js thanks for uploading node.js",
      "20":" Great tutorial, thanks much :) Great tutorial, thanks much :) Great tutorial, thanks much :) Great tutorial, thanks much :) Great tutorial, thanks much :) Great tutorial, thanks much :) Great tutorial, thanks much :) Great tutorial, thanks much :)",
      "21":" Best nodejs tutorial ever! Best nodejs tutorial ever! Best nodejs tutorial ever! Best nodejs tutorial ever! Best nodejs tutorial ever! Best nodejs tutorial ever! Best nodejs tutorial ever! Best nodejs tutorial ever!",
      "22":" A much needed course for every node.js beginner A much needed course for every node.js beginner A much needed course for every node.js beginner A much needed course for every node.js beginner",
      "23":" 1:15:10 Google says Happy Teachers Day while Pedro is teaching us. :) 1:15:10 Google says Happy Teachers Day while Pedro is teaching us. :) 1:15:10 Google says Happy Teachers Day while Pedro is teaching us. :) 1:15:10 Google says Happy Teachers Day while Pedro is teaching us. :)",
      "24":" I love the voice! I love the voice! I love the voice! I love the voice! I love the voice! I love the voice! I love the voice! I love the voice!",
      "25":" Thank you for the great video! Thank you for the great video! Thank you for the great video! Thank you for the great video! Thank you for the great video! Thank you for the great video! Thank you for the great video! Thank you for the great video!",
      "26":" Non ad video i love that Non ad video i love that Non ad video i love that Non ad video i love that Non ad video i love that Non ad video i love that Non ad video i love that Non ad video i love that",
      "27":" this video is really lit1 thanks alot! this video is really lit1 thanks alot! this video is really lit1 thanks alot! this video is really lit1 thanks alot!",
      "28":" Love the video. Keep it going. Love the video. Keep it going. Love the video. Keep it going. Love the video. Keep it going. Love the video. Keep it going. Love the video. Keep it going. Love the video. Keep it going. Love the video. Keep it going.",
      "29":" Thank you very much for this tutorial, helped me a lot to get started, didn't stop for anything, very well explained! Thank you very much for this tutorial, helped me a lot to get started, didn't stop for anything, very well explained!",
      "30":" Brilliant! Expands on what really happens under the hood when you use your favourite libraries. Brilliant! Expands on what really happens under the hood when you use your favourite libraries.",
      "31":" Great video! Very useful! Thank you :) Great video! Very useful! Thank you :) Great video! Very useful! Thank you :) Great video! Very useful! Thank you :)",
      "32":" Amazing. Thank you guys!!! Amazing. Thank you guys!!! Amazing. Thank you guys!!! Amazing. Thank you guys!!! Amazing. Thank you guys!!! Amazing. Thank you guys!!! Amazing. Thank you guys!!! Amazing. Thank you guys!!!",
      "33":" It would help a lot if there was a link to all these exercises on GitHub. It would help a lot if there was a link to all these exercises on GitHub.",
      "34":" one of the best tutorials I've seen for any language... very level appropriate for those coming from other languages.  I have experience in BASIC, perl, python, C, C#, and some C++ and this clearly delineates the structure, typing, and syntax of the language fairly quickly (at least if you watch it at 2x like I did?)",
      "35":" Isn't the req.body already in json? Isn't the req.body already in json? Isn't the req.body already in json? Isn't the req.body already in json? Isn't the req.body already in json? Isn't the req.body already in json? Isn't the req.body already in json? Isn't the req.body already in json?",
      "36":" Thank you so much for this tutorial :) Thank you so much for this tutorial :) Thank you so much for this tutorial :) Thank you so much for this tutorial :)",
      "37":" Really Helpful video on Nodejs. Watched without any break and didn't feel bore. learned a lot. thanks alot sir. appreciated Really Helpful video on Nodejs. Watched without any break and didn't feel bore. learned a lot. thanks alot sir. appreciated",
      "38":" thank you so much....please keep uploading such tutorials thank you so much....please keep uploading such tutorials thank you so much....please keep uploading such tutorials thank you so much....please keep uploading such tutorials",
      "39":" Thank you for this wonderful  tutorial!!! Thank you for this wonderful  tutorial!!! Thank you for this wonderful  tutorial!!! Thank you for this wonderful  tutorial!!! Thank you for this wonderful  tutorial!!! Thank you for this wonderful  tutorial!!! Thank you for this wonderful  tutorial!!! Thank you for this wonderful  tutorial!!!",
      "40":" Lovely tutorial! Thanks a lot! Lovely tutorial! Thanks a lot! Lovely tutorial! Thanks a lot! Lovely tutorial! Thanks a lot! Lovely tutorial! Thanks a lot! Lovely tutorial! Thanks a lot! Lovely tutorial! Thanks a lot! Lovely tutorial! Thanks a lot!",
      "41":" I've been using node for quite a while, but this is a very helpful refresher. Thank you! I've been using node for quite a while, but this is a very helpful refresher. Thank you!",
      "42":" 4:29 another trick to do this is going to your requested path, and type cmd where the file location is and hit enter :) this opens a cmd in the current directory ur in.",
      "43":" It's nice when someone takes a step back now and then to explain WHY we are doing something. You do that very well. It's nice when someone takes a step back now and then to explain WHY we are doing something. You do that very well.",
      "44":" I would like to thank you for your awesome tutorial.\nYou make it really easy to understand and not boring at all.\nPlease keep going you're doing great !!!",
      "45":" Thank you! Great lesson! \nsorry buy it's hard to follow you with this type of screen(only couple line of code on whole screen...) Thank you! Great lesson! \nsorry buy it's hard to follow you with this type of screen(only couple line of code on whole screen...)",
      "46":" Hello, Thank you for sharing video. Could you please share the code on Github so we can download it. Hello, Thank you for sharing video. Could you please share the code on Github so we can download it.",
      "47":" Best node.js tutorial ever! Until I found this, everything looked like very complicated about node.js. But this is very simple and clean. Thank you so much Pedro",
      "48":" Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton! Thanks a ton!",
      "49":" thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot! thanks a lot!",
      "50":" All that to print Pedro....\nThanks for the knowledge I will be learning more about this in time. All that to print Pedro....\nThanks for the knowledge I will be learning more about this in time.",
      "51":" Awesome video. Thank you so much for this video. I would love to see more videos on this topic from you. Awesome video. Thank you so much for this video. I would love to see more videos on this topic from you.",
      "52":" very nice video it helped me to shift from python backend development to nodejs backend very nice video it helped me to shift from python backend development to nodejs backend",
      "53":" thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this thanks for this",
      "54":" fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!! fantastic tutorial..!!",
      "55":" Your tutorial is awesome. Thank you NoodCoder Your tutorial is awesome. Thank you NoodCoder Your tutorial is awesome. Thank you NoodCoder Your tutorial is awesome. Thank you NoodCoder",
      "56":" For anyone who might not be able to run it after installing. Make sure to set your variable path. Probably the most important part For anyone who might not be able to run it after installing. Make sure to set your variable path. Probably the most important part",
      "57":" Great video to watch at 1.5x speed, the talking pace was a bit slow. Good content though. Great video to watch at 1.5x speed, the talking pace was a bit slow. Good content though.",
      "58":" Great course! well explained Great course! well explained Great course! well explained Great course! well explained Great course! well explained Great course! well explained Great course! well explained Great course! well explained",
      "59":" it would have been relly helpful if the codes were given it would have been relly helpful if the codes were given it would have been relly helpful if the codes were given it would have been relly helpful if the codes were given",
      "60":" Everyone, for when doing ejs you have to do npm install ejs in order for it to work properly. Everyone, for when doing ejs you have to do npm install ejs in order for it to work properly.",
      "61":" Hey, nice video about the readline module. If you enter Ctrl + C in the command line it triggers the rl.on(\"close\") event, and then go on saying you are correct. I think you can correct this by creating a child class and editing the close event call back and you can pass a parameter to know where it was fired from. Get it??",
      "62":" Okay I got lost at the event thing lol Okay I got lost at the event thing lol Okay I got lost at the event thing lol Okay I got lost at the event thing lol",
      "63":" perfect Tutorial , thanks too much perfect Tutorial , thanks too much perfect Tutorial , thanks too much perfect Tutorial , thanks too much perfect Tutorial , thanks too much perfect Tutorial , thanks too much perfect Tutorial , thanks too much perfect Tutorial , thanks too much",
      "64":" how to allow the module version update for major version in package.json? how to allow the module version update for major version in package.json? how to allow the module version update for major version in package.json? how to allow the module version update for major version in package.json?",
      "65":" Literally one of th ebest node  tutorial...Thanks dude....YOu're great..!! Literally one of th ebest node  tutorial...Thanks dude....YOu're great..!! Literally one of th ebest node  tutorial...Thanks dude....YOu're great..!! Literally one of th ebest node  tutorial...Thanks dude....YOu're great..!!",
      "66":" 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar 1:10:26 classic winrar",
      "67":" great video! Are there any other server side validation packages as joi is deprecated? great video! Are there any other server side validation packages as joi is deprecated?",
      "68":" (1:07:37) The path for the file to be piped with the readable stream must be relative... Else it won't work (tested with Node.js 15) (1:07:37) The path for the file to be piped with the readable stream must be relative... Else it won't work (tested with Node.js 15)",
      "69":" I have windows 10 pro and I want to find the directory through documents but the layout is different because I recently had a computer upgrade so my documents don't look like this. So I can't find the URL to the directory on the top like how you did where can i find it?",
      "70":" Your tutorial is awesome, not only nodejs, we can learn alot more. Thanks million! Your tutorial is awesome, not only nodejs, we can learn alot more. Thanks million!",
      "71":" I love bananas, too, brother I love bananas, too, brother I love bananas, too, brother I love bananas, too, brother I love bananas, too, brother I love bananas, too, brother I love bananas, too, brother I love bananas, too, brother",
      "72":" Thank you! Great lesson! Thank you! Great lesson! Thank you! Great lesson! Thank you! Great lesson! Thank you! Great lesson! Thank you! Great lesson! Thank you! Great lesson! Thank you! Great lesson!",
      "73":" Thank you this was very useful Thank you this was very useful Thank you this was very useful Thank you this was very useful Thank you this was very useful Thank you this was very useful Thank you this was very useful Thank you this was very useful",
      "74":" Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you.",
      "75":" Hey !! It's an amazing tutorial , u example very good , amazing Hey !! It's an amazing tutorial , u example very good , amazing",
      "76":" what extensions do you use for auto-completion and suggestions? what extensions do you use for auto-completion and suggestions? what extensions do you use for auto-completion and suggestions? what extensions do you use for auto-completion and suggestions?",
      "77":" well, it is good that the code is readable.We can see every thing; well, it is good that the code is readable.We can see every thing;",
      "78":" Best tutorial that what do i say............ Best tutorial that what do i say............ Best tutorial that what do i say............ Best tutorial that what do i say............",
      "79":" i saw this vid on 1.5 speed until i got to the last 3 min, i got so used to u on speed that u sounded drunk on normal speed lol.\nanyway great job on this tut really like that u dived more then the other usual express\/node tut here in youtube. ",
      "80":" 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23 04:23",
      "81":" @2:39 Actually, ctrl+` (the button above the 'tab' key) will also bring up the terminal. @2:39 Actually, ctrl+` (the button above the 'tab' key) will also bring up the terminal."
   },
   "classification": {
      "1":" \/Science\/Computer Science",
      "2":" failed",
      "3":" \/Arts & Entertainment",
      "4":" \/Arts & Entertainment\/Music & Audio",
      "5":" failed",
      "6":" failed",
      "7":" failed",
      "8":" failed",
      "9":" \/Science\/Computer Science",
      "10":" failed",
      "11":" failed",
      "12":" failed",
      "13":" failed",
      "14":" failed",
      "15":" failed",
      "16":" failed",
      "17":" \/Arts & Entertainment\/TV & Video\/Online Video",
      "18":" failed",
      "19":" failed",
      "20":" failed",
      "21":" failed",
      "22":" failed",
      "23":" failed",
      "24":" failed",
      "25":" failed",
      "26":" failed",
      "27":" failed",
      "28":" failed",
      "29":" \/Reference\/General Reference",
      "30":" failed",
      "31":" failed",
      "32":" failed",
      "33":" failed",
      "34":" \/Jobs & Education\/Education",
      "35":" failed",
      "36":" failed",
      "37":" \/Computers & Electronics\/Computer Security",
      "38":" failed",
      "39":" failed",
      "40":" failed",
      "41":" failed",
      "42":" failed",
      "43":" failed",
      "44":" failed",
      "45":" failed",
      "46":" failed",
      "47":" \/Reference\/General Reference",
      "48":" failed",
      "49":" failed",
      "50":" \/Business & Industrial",
      "51":" \/Arts & Entertainment\/Online Media",
      "52":" failed",
      "53":" failed",
      "54":" failed",
      "55":" failed",
      "56":" \/Computers & Electronics",
      "57":" \/Arts & Entertainment\/Online Media",
      "58":" failed",
      "59":" failed",
      "60":" \/Science\/Computer Science",
      "61":" \/Science\/Computer Science",
      "62":" failed",
      "63":" failed",
      "64":" failed",
      "65":" failed",
      "66":" failed",
      "67":" failed",
      "68":" failed",
      "69":" \/Computers & Electronics\/Software\/Operating Systems",
      "70":" failed",
      "71":" failed",
      "72":" failed",
      "73":" failed",
      "74":" failed",
      "75":" failed",
      "76":" failed",
      "77":" failed",
      "78":" failed",
      "79":" \/Arts & Entertainment\/TV & Video",
      "80":" failed",
      "81":" failed"
   }
}